---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.ComponentClassification
source: html/7abbd56a-3b9a-f51e-861c-5f034fec614e.htm
---
# Autodesk.Revit.DB.Mechanical.ComponentClassification

An enumerated type lists all MEP component classification. This attribute describes the general purpose of the MEP part component, that is used for scheduling, tagging, filter, ODBC, and etc.
 One component classification may include more than one part type.

## Syntax (C#)
```csharp
public enum ComponentClassification
```